# ### 字符串
""" 用引号引起来的就是字符串  '' "" ''' ''' """

"""
# 转义字符: \ + 某个字符
将有意义的字符变得无意义
将无意义的字符变得有意义

\n , \r\n 换行
\t 缩进 水平制表符
\r 将\r后面的字符直接拉到当前行首
"""



# (1)单引号字符串
strvar = '今天教室里很热'
print(strvar)
print(type(strvar))

# (2)双引号字符串
strvar = "小楼昨夜\n又东风"
strvar = "故国不堪回首\r\n月明中"
strvar = "故国不堪回首\t月明中"
strvar = "故国不堪回首\r月明中"
strvar = "故国不堪\n回首\r月明中"
# 将有意义的双引号变得无意义.如果外面是双引号,里面是单引号,与注释嵌套的注意点一样.
strvar = "故国不堪'回首'\"月\"明中"
print(strvar)

# (3)三引号字符串 (支持跨行操作)
strvar = """
本来无一物,
何处惹尘埃
"""

strvar = '''
床前'明月'光,
地上鞋"两双".
'''

print(strvar,type(strvar))

# (4)元字符串 r"字符串" 不转义字符,原型化输出字符串
strvar = r"D:\深圳全栈七期\上课内容\note2"
print(strvar)

# (5)格式化字符串
"""
%d 整型占位符
%f 浮点型占位符
%s 字符串占位符

"字符串" % (赋值1,赋值2,......)
"""
# %d 整型占位符
strvar = "田志平昨天晚上买了%d个娃娃" % (3)
print(strvar)

# %2d 占2位 原字符默认具右
strvar = "陈雄风买了%2d个金油" % (3)
print(strvar)

# %-3d 占3位 原字符默认具左
strvar = "陈雄风买了%-3d个金油" % (4)
print(strvar)


# %f 浮点型占位符 默认小数点保留6位
strvar = "梁平波今天开工资了,一共发了%f元" % (9.9)
print(strvar)
# %.2f 小数点保留2位
strvar = "梁平波今天开工资了,一共发了%.2f元" % (9.9)
print(strvar)
# %f 是存在四舍五入的情况
strvar = "梁平波今天开工资了,一共发了%.1f元" % (9.891)
print(strvar)


# %s 字符串占位符
strvar = "%s" % ("陈翔 和 刘翔只差一个字")
print(strvar)

# 综合案例
strvar = "%s 看好了一辆车,布加迪威龙,买了%d辆,一共花了%.2f元,心情%s" % ("卢艳伟",2,20.32,"感觉买了个假车")
print(strvar)

# 字符串的格式化存在类型转换 [在不清楚类型的时候,直接%s]
strvar = "%s 看好了一辆车,布加迪威龙,买了%s辆,一共花了%s元,心情%s" % ("卢艳伟",2,20.32,"感觉买了个假车")
print(strvar)



