# ### Day_3 练习
"""
1.int,float,complex,bool 分别可以强转哪些数据

2.强转布尔类型为假的值有哪些?

3.容器类型强转的规律?强转字典的条件

4.[1,2,3,4,[5,6,7,[8,9,10,(11,{"a":{"bb":98},"pp":{"d":”bingo”}})]]] bingo如何取?

5.99//4 , 99%4 , -99 %4值是多少


6.成员身份运算符如何使用?

7.逻辑运算符优先级?逻辑短路在什么情况下发生?

8.res = 17>15 or 78<11 or 7 and 8 and not True is True  res=?

9.计算如下值
1).6 or 2 > 1      
2).3 or 2 > 1     
3).0 or 5 > 4     
4).5 < 4 or 3     
5).2 > 1 or 6      
6).3 and 2 > 1     
7).0 and 3 > 1     
8).2 > 1 and 3     
9).3 > 1 and 0     
10).3 > 1 and 2 or 2 < 3 and 3 and 4 or 3 > 2 

"""




