# ### 注释： 就是对代码的解释,目的是方便大家阅读代码
# (1) 注释的分类 :1单行注释 2.多行注释

# 1单行注释
# python2.x print "123456" 
# python3.x print("123456")

print("hello world") # 打印print()中的内容

# 2多行注释
# 可以使用 三个单引号 也可以使用 三个双引号,两种方法效果相同

# 三个单引号注释
'''
print("清十八，儒雅随和")
print("北雨栖风，风大收人密我")
print("余文乐，生日快乐!")
print("恶人谷的风好大，收苍藏霸")
print("大小GF，都上YY411894")
print("再不日常，帮会要凉")
'''

# 三个双引号注释
"""
print("清十八，儒雅随和")
print("北雨栖风，风大收人密我")
print("余文乐，生日快乐!")
print("恶人谷的风好大，收苍藏霸")
print("大小GF，都上YY411894")
print("再不日常，帮会要凉")
"""


# (2)注释的注意点
#小心注释的嵌套，如果外面是 三个双引号，里面用 三个单引号,反之用 三个双引号

"""
print("清十八，儒雅随和")
print("北雨栖风，风大收人密我")
print("余文乐，生日快乐!")
'''
print("恶人谷的风好大，收苍藏霸")
'''
print("大小GF，都上YY411894")
print("再不日常，帮会要凉")
"""


'''
print("清十八，儒雅随和")
print("北雨栖风，风大收人密我")
print("余文乐，生日快乐!")
print("恶人谷的风好大，收苍藏霸")
"""
print("大小GF，都上YY411894")
"""
print("再不日常，帮会要凉")
'''

# (3)注释的排错性
# 包裹一部分代码，然后去执行另外一部分，如果没有问题，继续打开一部分代码进行测试，依次寻找

"""
print("清十八，儒雅随和")
print("北雨栖风，风大收人密我")
print("余文乐，生日快乐!")
"""
print("恶人谷的风好大，收苍藏霸")

print("大小GF，都上YY411894")

print("再不日常，帮会要凉")
