# ### 字符串 : 用引号引起来的就是字符串 
# 引号: 单引号 双引号 三引号

"""
# 转义字符: \ + 字符 
	(1) 将有意义的字符变得无意义
	(2) 将无意义的字符变得有意义
	
\n , \r\n  : 都代表换行的意思
\r : 把\r后面所有的字符串拉到当前行首
\t : 一个缩进(水平制表符)
"""

# (1) 单引号 ' ' 
strvar = '上线不日常,帮主泪两行'
print(strvar)
print( type(strvar) ) # str字符串类型

# (2) 双引号

# 无意义的字符变得有意义
strvar = "上线不日常,帮主泪两行"
strvar = "上线不日常,\n帮主泪两行"
strvar = "上线不日常,\r帮主泪两行"
strvar = "上线不日常\n,帮主\r泪两行"
strvar = "上线\t不日常"

# 有意义的字符变得无意义 
strvar = "上线'不'日常,帮主泪两行" # 与注释的嵌套注意点相同
strvar = "上线\"不\"日常,帮主泪两行"
print(strvar) 
print( type(strvar) )
    
# (3) 三引号 支持跨行
strvar = '''
长针两千七,
后跳吃盾击

'''
strvar = """
长'针'两"千"七,
后跳吃盾击
"""
print(strvar)
print( type(strvar) )


# (4) 元字符串 : 在字符串的开头加上一个r
"""不进行转义,原型化输出内容"""

strvar = r"D:\Game\jx3\bin\facedata"
print(strvar)

# (5) 字符串的格式化
"""
语法:
	"字符串" % (值1,值2 ... )
	
占位符:
	%d 整型占位符
	%f 浮点型占位符
	%s 字符串占位符
"""

# %d   整型占位符
strvar = "北雨栖风面容非常憔悴,因为昨天晚上收了%d个新人" % (5)
print(strvar)
# %2d  占用两位,原字符居右
strvar = "北雨栖风面容非常憔悴,因为昨天晚上收了%2d个新人" % (5)
print(strvar)
# %-2d 占用两位,原字符居左
strvar = "北雨栖风面容非常憔悴,因为昨天晚上收了%-2d个新人" % (5)
print(strvar)


# %f 浮点型占位符 默认小数位保留6位
strvar = "清十八昨天发奖励了,一共发了%f金" % (400000.5)
print(strvar)
# %.2f 小数点保留两位
strvar = "清十八昨天发奖励了,一共发了%.2f金" % (400000.5)
print(strvar)

# %s 字符串占位符
strvar = "%s" % ("清十八杠上花")
print(strvar)

# 在不确定类型的情况下,统一用%s,这里会强制转化成字符串类型;
strvar = "清十八买了%s把大橙武,花了%s金" % (5,500.5)
# %f 存在四舍五入的情况
strvar = "清十八买了%d把大橙武,花了%.1f金" % (5,500.198)
print(strvar)
