# ### 内存的缓存机制:

# -->Number 部分
"""
1.对于整型而言，-5~正无穷范围内的相同值 id一致
2.对于浮点数而言，非负数范围内的相同值 id一致
3.布尔值而言,值相同情况下，id一致
4.复数在 实数+虚数 这样的结构中永不相同(只有虚数的情况例外)
"""

# 1.对于整型而言，-5~正无穷范围内的相同值,id一致
var1 = 90
var2 = 90
var1 = -100
var2 = -100
print( id(var1) ,id(var2) )

# 2.对于浮点数而言，非负数范围内的相同值,id一致
var1 = 9.67
var2 = 9.67
print( id(var1) ,id(var2) )

# 3.对于布尔值而言,值相同情况下,id一致
var1 = True
var2 = False
print( id(var1) ,id(var2) )

# 4.对于复数在 实数+虚数 的结构中永不相同(只有虚数的情况例外)
var1 = 5+3j
var2 = 5+3j
var1 = 6j
var2 = 6j
print( id(var1) ,id(var2) )


# -->容器类型部分
"""
5.字符串 和 空元组 相同的情况下，地址相同
6.列表，元组，字典，集合无论什么情况 id标识都不同 [空元组例外]
"""
var1 = "清"
var2 = "清"
var1 = ()
var2 = ()
var1 = [1,2,3]
var2 = [1,2,3]
print( id(var1) ,id(var2) )
